[Survived] BlockStatement
main/components/Jobs/UploadGradesJobForm.js:9:35
 
 function UploadGradesJobForm() {
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    // callback({});
-  };
+  const handleSubmit = (event) => {};
 
   // Stryker disable all : Stryker is testing by changing the padding to 0. But this is simply a visual optimization as it makes it look better
