[Survived] ArrowFunction
src/main/pages/AdminJobsPage.js:51:46
     method: "POST",
   });
 
-  const objectToAxiosParamsUploadGradesJob = () => ({
-    url: `/api/jobs/launch/uploadGradeData`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUploadGradesJob = () => undefined;
 
   // Stryker disable all

[Survived] StringLiteral
src/main/pages/AdminJobsPage.js:52:10
   });
 
   const objectToAxiosParamsUploadGradesJob = () => ({
-    url: `/api/jobs/launch/uploadGradeData`,
+    url: ``,
     method: "POST",
   });

[Survived] BlockStatement
src/main/pages/AdminJobsPage.js:93:49
     updateCoursesByQuarterRangeJobMutation.mutate(data);
   };
 
-  const submitUploadGradesJob = async (data) => {
-    uploadGradesJobMutation.mutate(data);
-  };
+  const submitUploadGradesJob = async (data) => {};
 
   // Stryker disable all
