[Killed] ArrowFunction
main/pages/PersonalSchedules/PersonalSchedulesCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function PersonalSchedulesCreatePage() {
-  const objectToAxiosParams = (personalSchedule) => ({
-    url: "/api/personalschedules/post",
-    method: "POST",
-    params: {
-      name: personalSchedule.name,
-      description: personalSchedule?.description || "",
-      quarter: personalSchedule.quarter,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (personalSchedule) => {
killedBy: PersonalSchedulesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/pages/PersonalSchedules/PersonalSchedulesCreatePage.js:13:20
     method: "POST",
     params: {
       name: personalSchedule.name,
-      description: personalSchedule?.description || "",
+      description: personalSchedule?.description && "",
       quarter: personalSchedule.quarter,
     },
killedBy: PersonalSchedulesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "description": "desc",
+   "description": "",

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesCreatePage.js:13:20
     method: "POST",
     params: {
       name: personalSchedule.name,
-      description: personalSchedule?.description || "",
+      description: false,
       quarter: personalSchedule.quarter,
     },
killedBy: PersonalSchedulesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "description": "desc",
+   "description": false,
