[Killed] BlockStatement
main/components/PersonalSections/PersonalSectionsTable.js:27:42
     [],
   );
   // Stryker restore all
-  const deleteCallback = async (cell) => {
-    deleteMutation.mutate({ cell, psId });
-  };
+  const deleteCallback = async (cell) => {};
 
   const columns = [
killedBy: PersonalSectionsTable tests Delete button calls delete callback for user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"cell": Any<Object>, "psId": 1}

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/PersonalSections/PersonalSectionsTable.js:34:17
   const columns = [
     {
       Header: "Course ID",
-      accessor: "courseId",
+      accessor: "",
     },
     {
killedBy: PersonalSectionsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSectionsTable-cell-row-0-col-courseId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/PersonalSections/PersonalSectionsTable.js:48:5
       Header: "Title",
       accessor: "title",
     },
-    {
-      Header: "Enrolled",
-      accessor: (row) =>
-        convertToFraction(
-          row.classSections[0].enrolledTotal,
-          row.classSections[0].maxEnroll,
-        ),
-      id: "enrolled",
-    },
+    {},
     {
       Header: "Location",
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/PersonalSections/PersonalSectionsTable.js:57:5
         ),
       id: "enrolled",
     },
-    {
-      Header: "Location",
-      accessor: (row) => formatLocation(row.classSections[0].timeLocations),
-      id: "location",
-    },
+    {},
     {
       Header: "Days",
killedBy: PersonalSectionsTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/PersonalSections/PersonalSectionsTable.js:58:15
       id: "enrolled",
     },
     {
-      Header: "Location",
+      Header: "",
       accessor: (row) => formatLocation(row.classSections[0].timeLocations),
       id: "location",
killedBy: PersonalSectionsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Location. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/PersonalSections/PersonalSectionsTable.js:60:11
     {
       Header: "Location",
       accessor: (row) => formatLocation(row.classSections[0].timeLocations),
-      id: "location",
+      id: "",
     },
     {
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSectionsTable-cell-row-0-col-location"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/PersonalSections/PersonalSectionsTable.js:83:18
     ButtonColumn("Delete", "danger", deleteCallback, "PersonalSectionsTable"),
   ];
 
-  const testid = "PersonalSectionsTable";
+  const testid = "";
 
   const columnsToDisplay = hasRole(currentUser, "ROLE_USER")
killedBy: PersonalSectionsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSectionsTable-cell-row-0-col-courseId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
