[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:5:10
 import { toast } from "react-toastify";
 
 export const convertToFraction = (en1, en2) => {
-  return en1 != null && en2 != null ? `${en1}/${en2}` : "";
+  return true ? `${en1}/${en2}` : "";
 };
 
killedBy: section utils tests convertToFraction one null test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "null/100"

[Killed] StringLiteral
src/main/utils/sectionUtils.js:13:14
   try {
     let res = "";
     for (let index = 0; index < timeLocationArray.length; index++) {
-      res += `${timeLocationArray[index].building} ${timeLocationArray[index].room}`;
+      res += ``;
       if (index + 1 < timeLocationArray.length) {
         res += `, `;
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element with the text: LIB 1312. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
src/main/utils/sectionUtils.js:27:15
 // Takes a time location array and returns the days
 export const formatDays = (timeLocationArray) => {
   try {
-    let res = "";
+    let res = "Stryker was here!";
     for (let index = 0; index < timeLocationArray.length; index++) {
       res +=
killedBy: section utils tests formatDays test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "M W, R F"
Received: "Stryker was here!M W, R F"

[Killed] EqualityOperator
src/main/utils/sectionUtils.js:28:25
 export const formatDays = (timeLocationArray) => {
   try {
     let res = "";
-    for (let index = 0; index < timeLocationArray.length; index++) {
+    for (let index = 0; index <= timeLocationArray.length; index++) {
       res +=
         timeLocationArray[index].days !== null
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  M
Received:

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:30:9
     let res = "";
     for (let index = 0; index < timeLocationArray.length; index++) {
       res +=
-        timeLocationArray[index].days !== null
+        false
           ? `${timeLocationArray[index].days}`
           : "";
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  M
Received:

[Killed] StringLiteral
src/main/utils/sectionUtils.js:31:13
     for (let index = 0; index < timeLocationArray.length; index++) {
       res +=
         timeLocationArray[index].days !== null
-          ? `${timeLocationArray[index].days}`
+          ? ``
           : "";
       if (
killedBy: section utils tests formatDays test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "M W, R F"
Received: ", "

[Killed] StringLiteral
src/main/utils/sectionUtils.js:32:13
       res +=
         timeLocationArray[index].days !== null
           ? `${timeLocationArray[index].days}`
-          : "";
+          : "Stryker was here!";
       if (
         index + 1 < timeLocationArray.length &&
killedBy: section utils tests formatDays test 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "R F"
Received: "Stryker was here!R F"

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:34:9
           ? `${timeLocationArray[index].days}`
           : "";
       if (
-        index + 1 < timeLocationArray.length &&
-        timeLocationArray[index].days !== null
+        true
       ) {
         res += `, `;
killedBy: section utils tests formatDays test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "M W, R F"
Received: "M W, R F, "

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:34:9
           ? `${timeLocationArray[index].days}`
           : "";
       if (
-        index + 1 < timeLocationArray.length &&
+        true &&
         timeLocationArray[index].days !== null
       ) {
killedBy: section utils tests formatDays test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "M W, R F"
Received: "M W, R F, "

[Killed] BlockStatement
src/main/utils/sectionUtils.js:36:9
       if (
         index + 1 < timeLocationArray.length &&
         timeLocationArray[index].days !== null
-      ) {
-        res += `, `;
-      }
+      ) {}
     }
     return res;
killedBy: section utils tests formatDays test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "M W, R F"
Received: "M WR F"

[Killed] EqualityOperator
src/main/utils/sectionUtils.js:55:11
         hhmmTohhmma(timeLocationArray[index].beginTime),
         hhmmTohhmma(timeLocationArray[index].endTime),
       );
-      if (index + 1 < timeLocationArray.length) {
+      if (index + 1 >= timeLocationArray.length) {
         res += `, `;
       }
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element with the text: 2:00 PM - 3:15 PM. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:69:25
 export const formatInstructors = (instructorArray) => {
   try {
     let res = "";
-    for (let index = 0; index < instructorArray.length; index++) {
+    for (let index = 0; false; index++) {
       res += `${instructorArray[index].instructor}`;
       if (index + 1 < instructorArray.length) {
killedBy: section utils tests formatInstructors test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "HESPANHA J P, JOHN S"
Received: ""

[Killed] ArithmeticOperator
src/main/utils/sectionUtils.js:71:11
     let res = "";
     for (let index = 0; index < instructorArray.length; index++) {
       res += `${instructorArray[index].instructor}`;
-      if (index + 1 < instructorArray.length) {
+      if (index - 1 < instructorArray.length) {
         res += `, `;
       }
killedBy: section utils tests formatInstructors test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "HESPANHA J P, JOHN S"
Received: "HESPANHA J P, JOHN S, "

[Killed] BlockStatement
src/main/utils/sectionUtils.js:81:35
   }
 };
 
-export const isSection = (en1) => {
-  return en1.substring(2) !== "00";
-};
+export const isSection = (en1) => {};
 
 // returns the course status based on cancel, closed, or full
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsOverTimeTable-cell-row-5-col-location"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:82:10
 };
 
 export const isSection = (en1) => {
-  return en1.substring(2) !== "00";
+  return true;
 };
 
killedBy: Section tests First dropdown is different than last dropdown
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="SectionsOverTimeTable-cell-row-1-col-enrolled"]

Here are the matching elements:

<td
  data-testid="SectionsOverTimeTable-cell-row-1-col-enrolled"
  role="cell"
  style="background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;"

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:89:14
 export const formatStatus = (section) => {
   if (section.courseCancelled) {
     return "Cancelled";
-  } else if (section.classClosed === "Y") {
+  } else if (false) {
     return "Closed";
   } else if (section.enrolledTotal >= section.maxEnroll) {
killedBy: Section tests Status utility identifies each type of status
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Closed
Received:
  Full

[Killed] EqualityOperator
src/main/utils/sectionUtils.js:91:14
     return "Cancelled";
   } else if (section.classClosed === "Y") {
     return "Closed";
-  } else if (section.enrolledTotal >= section.maxEnroll) {
+  } else if (section.enrolledTotal > section.maxEnroll) {
     return "Full";
   } else {
killedBy: Section tests Status utility identifies each type of status
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Full
Received:
  Open

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:91:14
     return "Cancelled";
   } else if (section.classClosed === "Y") {
     return "Closed";
-  } else if (section.enrolledTotal >= section.maxEnroll) {
+  } else if (false) {
     return "Full";
   } else {
killedBy: Section tests Status utility identifies each type of status
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Full
Received:
  Open

[Killed] BlockStatement
src/main/utils/sectionUtils.js:93:10
     return "Closed";
   } else if (section.enrolledTotal >= section.maxEnroll) {
     return "Full";
-  } else {
-    return "Open";
-  }
+  } else {}
 };
 
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Open
Received:
  undefined

[Killed] ArrowFunction
src/main/utils/sectionUtils.js:98:31
   }
 };
 
-export const formatInfoLink = (row) =>
-  `/coursedetails/${row.courseInfo.quarter}/${row.section.enrollCode}`;
+export const formatInfoLink = () => undefined;
 
 export const renderInfoLink = ({ cell: { value } }) => (
killedBy: Section tests Info link is correct
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ArrowFunction
src/main/utils/sectionUtils.js:101:31
 export const formatInfoLink = (row) =>
   `/coursedetails/${row.courseInfo.quarter}/${row.section.enrollCode}`;
 
-export const renderInfoLink = ({ cell: { value } }) => (
-  <p align="center">
-    <a href={value} style={{ color: "white" }}>
-      <i className="fa fa-info-circle"></i>
-    </a>
-  </p>
-);
+export const renderInfoLink = () => undefined;
 
 export function onDeleteSuccess(message) {
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
src/main/utils/sectionUtils.js:103:37
 
 export const renderInfoLink = ({ cell: { value } }) => (
   <p align="center">
-    <a href={value} style={{ color: "white" }}>
+    <a href={value} style={{ color: "" }}>
       <i className="fa fa-info-circle"></i>
     </a>
killedBy: section utils tests renderInfoLink test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "white"
Received: ""

[Killed] ObjectLiteral
src/main/utils/sectionUtils.js:103:28
 
 export const renderInfoLink = ({ cell: { value } }) => (
   <p align="center">
-    <a href={value} style={{ color: "white" }}>
+    <a href={value} style={{}}>
       <i className="fa fa-info-circle"></i>
     </a>
killedBy: section utils tests renderInfoLink test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "white"
Received: undefined

[Killed] BlockStatement
src/main/utils/sectionUtils.js:114:57
   toast(message);
 }
 
-export function cellToAxiosParamsDelete({ cell, psId }) {
-  console.log(cell);
-  const enrollCode = cell.row.values["classSections[0].enrollCode"];
-  return {
-    url: "/api/personalSections/delete",
-    method: "DELETE",
-    params: {
-      psId: psId,
-      enrollCd: enrollCode,
-    },
-  };
-}
+export function cellToAxiosParamsDelete({ cell, psId }) {}
 
killedBy: section utils tests cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"enrollCd": "80300", "psId": 1}, "url": "/api/personalSections/delete"}
Received: undefined

[Killed] StringLiteral
src/main/utils/sectionUtils.js:116:38
 
 export function cellToAxiosParamsDelete({ cell, psId }) {
   console.log(cell);
-  const enrollCode = cell.row.values["classSections[0].enrollCode"];
+  const enrollCode = cell.row.values[""];
   return {
     url: "/api/personalSections/delete",
killedBy: section utils tests cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {

[Killed] StringLiteral
src/main/utils/sectionUtils.js:118:10
   console.log(cell);
   const enrollCode = cell.row.values["classSections[0].enrollCode"];
   return {
-    url: "/api/personalSections/delete",
+    url: "",
     method: "DELETE",
     params: {
killedBy: section utils tests cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,7 +2,7 @@
    "method": "DELETE",
    "params": Object {

[Killed] StringLiteral
src/main/utils/sectionUtils.js:119:13
   const enrollCode = cell.row.values["classSections[0].enrollCode"];
   return {
     url: "/api/personalSections/delete",
-    method: "DELETE",
+    method: "",
     params: {
       psId: psId,
killedBy: section utils tests cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "method": "DELETE",
