[Killed] BlockStatement
main/components/PersonalSections/PersonalSectionsTable.js:24:42
     { onSuccess: onDeleteSuccess },
     [],
   );
-  const deleteCallback = async (cell) => {
-    deleteMutation.mutate({ cell, psId });
-  };
+  const deleteCallback = async (cell) => {};
 
   const columns = [
killedBy: PersonalSectionsTable tests Delete button calls delete callback for user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"cell": Any<Object>, "psId": 1}

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/PersonalSections/PersonalSectionsTable.js:25:27
     [],
   );
   const deleteCallback = async (cell) => {
-    deleteMutation.mutate({ cell, psId });
+    deleteMutation.mutate({});
   };
 
killedBy: PersonalSectionsTable tests Delete button calls delete callback for user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "cell": Any<Object>,
-   "psId": 1,

[Killed] ObjectLiteral
main/components/PersonalSections/PersonalSectionsTable.js:63:5
       Header: "Days",
       accessor: "classSections[0].timeLocations[0].days",
     },
-    {
-      Header: "Time",
-      accessor: (row) => formatTime(row.classSections[0].timeLocations),
-      id: "time",
-    },
+    {},
     {
       Header: "Instructor",
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Error: A column ID (or string accessor) is required!
