[Killed] StringLiteral
src/main/components/SectionsTableBase.js:14:21
     useTable(
       {
         initialState: {
-          groupBy: ["courseInfo.courseId"],
+          groupBy: [""],
           hiddenColumns: ["isSection"],
         },
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-quarter"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Survived] StringLiteral
src/main/components/SectionsTableBase.js:15:27
       {
         initialState: {
           groupBy: ["courseInfo.courseId"],
-          hiddenColumns: ["isSection"],
+          hiddenColumns: [""],
         },
         columns,

[Survived] ArrayDeclaration
src/main/components/SectionsTableBase.js:15:26
       {
         initialState: {
           groupBy: ["courseInfo.courseId"],
-          hiddenColumns: ["isSection"],
+          hiddenColumns: [],
         },
         columns,

[Killed] ArrowFunction
src/main/components/SectionsTableBase.js:27:27
   return (
     <Table {...getTableProps()} striped bordered hover>
       <thead key="thead">
-        {headerGroups.map((headerGroup) => (
-          <tr {...headerGroup.getHeaderGroupProps()}>
-            {headerGroup.headers.map((column) => (
-              <th
-                {...column.getHeaderProps()}
-                data-testid={`${testid}-header-${column.id}`}
-                style={{ background: "#003262", color: "#FDB515" }} // UC Blue header with UC Gold text
-              >
-                {column.render("Header")}
-              </th>
-            ))}
-          </tr>
-        ))}
+        {headerGroups.map(() => undefined)}
       </thead>
       <tbody {...getTableBodyProps()} key="tbody">
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element with the text: Quarter. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
src/main/components/SectionsTableBase.js:29:38
       <thead key="thead">
         {headerGroups.map((headerGroup) => (
           <tr {...headerGroup.getHeaderGroupProps()}>
-            {headerGroup.headers.map((column) => (
-              <th
-                {...column.getHeaderProps()}
-                data-testid={`${testid}-header-${column.id}`}
-                style={{ background: "#003262", color: "#FDB515" }} // UC Blue header with UC Gold text
-              >
-                {column.render("Header")}
-              </th>
-            ))}
+            {headerGroup.headers.map(() => undefined)}
           </tr>
         ))}
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element with the text: Quarter. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Survived] StringLiteral
src/main/components/SectionsTableBase.js:33:38
               <th
                 {...column.getHeaderProps()}
                 data-testid={`${testid}-header-${column.id}`}
-                style={{ background: "#003262", color: "#FDB515" }} // UC Blue header with UC Gold text
+                style={{ background: "", color: "#FDB515" }} // UC Blue header with UC Gold text
               >
                 {column.render("Header")}

[Survived] StringLiteral
src/main/components/SectionsTableBase.js:45:28
         {rows.map((row, i) => {
           prepareRow(row);
           return (
-            <Fragment key={`row-${i}`}>
+            <Fragment key={``}>
               {row.cells[0].isGrouped ||
               (!row.cells[0].isGrouped && row.allCells[3].value) ? (

[Killed] LogicalOperator
src/main/components/SectionsTableBase.js:46:16
           prepareRow(row);
           return (
             <Fragment key={`row-${i}`}>
-              {row.cells[0].isGrouped ||
-              (!row.cells[0].isGrouped && row.allCells[3].value) ? (
+              {row.cells[0].isGrouped && !row.cells[0].isGrouped && row.allCells[3].value ? (
                 <tr {...row.getRowProps()}>
                   {row.cells.map((cell, _index) => {
killedBy: Section Searches Index Page tests calls UCSB section search api correctly with 1 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
src/main/components/SectionsTableBase.js:56:31
                         data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
                         style={{
                           background: cell.isGrouped
-                            ? "#003262" // UC Blue background for grouped cells
+                            ? "" // UC Blue background for grouped cells
                             : cell.isAggregated
                             ? "#003262" // UC Blue background for aggregated cells
killedBy: SectionsTableBase tests renders five sections (one with no discussion then lecture with three discussions) correctly
statusReason: Error: expect(element).toHaveAttribute("style", "background: rgb(0, 50, 98); color: rgb(253, 181, 21); font-weight: bold;") // element.getAttribute("style") === "background: rgb(0, 50, 98); color: rgb(253, 181, 21); font-weight: bold;"

Expected the element to have attribute:
  style="background: rgb(0, 50, 98); color: rgb(253, 181, 21); font-weight: bold;"
Received:
  style="color: rgb(253, 181,

[Survived] StringLiteral
src/main/components/SectionsTableBase.js:58:31
                           background: cell.isGrouped
                             ? "#003262" // UC Blue background for grouped cells
                             : cell.isAggregated
-                            ? "#003262" // UC Blue background for aggregated cells
+                            ? "" // UC Blue background for aggregated cells
                             : "#FDB515", // UC Gold background for regular cells
                           color: cell.isGrouped

[Survived] StringLiteral
src/main/components/SectionsTableBase.js:59:31
                             ? "#003262" // UC Blue background for grouped cells
                             : cell.isAggregated
                             ? "#003262" // UC Blue background for aggregated cells
-                            : "#FDB515", // UC Gold background for regular cells
+                            : "", // UC Gold background for regular cells
                           color: cell.isGrouped
                             ? "#FDB515" // UC Gold text for grouped cells

[Survived] StringLiteral
src/main/components/SectionsTableBase.js:63:31
                           color: cell.isGrouped
                             ? "#FDB515" // UC Gold text for grouped cells
                             : cell.isAggregated
-                            ? "#FDB515" // UC Gold text for aggregated cells
+                            ? "" // UC Gold text for aggregated cells
                             : "#003262", // UC Blue text for regular cells
                           fontWeight: cell.isGrouped || cell.isAggregated

[Killed] LogicalOperator
src/main/components/SectionsTableBase.js:65:39
                             : cell.isAggregated
                             ? "#FDB515" // UC Gold text for aggregated cells
                             : "#003262", // UC Blue text for regular cells
-                          fontWeight: cell.isGrouped || cell.isAggregated
+                          fontWeight: cell.isGrouped && cell.isAggregated
                             ? "bold"
                             : "normal",
killedBy: SectionsTableBase tests renders five sections (one with no discussion then lecture with three discussions) correctly
statusReason: Error: expect(element).toHaveAttribute("style", "background: rgb(0, 50, 98); color: rgb(253, 181, 21); font-weight: bold;") // element.getAttribute("style") === "background: rgb(0, 50, 98); color: rgb(253, 181, 21); font-weight: bold;"

Expected the element to have attribute:
  style="background: rgb(0, 50, 98); color: rgb(253, 181, 21); font-weight: bold;"
Received:
  style="background: rgb(0, 50

[Killed] ConditionalExpression
src/main/components/SectionsTableBase.js:65:39
                             : cell.isAggregated
                             ? "#FDB515" // UC Gold text for aggregated cells
                             : "#003262", // UC Blue text for regular cells
-                          fontWeight: cell.isGrouped || cell.isAggregated
+                          fontWeight: false
                             ? "bold"
                             : "normal",
killedBy: SectionsTableBase tests renders five sections (one with no discussion then lecture with three discussions) correctly
statusReason: Error: expect(element).toHaveAttribute("style", "background: rgb(0, 50, 98); color: rgb(253, 181, 21); font-weight: bold;") // element.getAttribute("style") === "background: rgb(0, 50, 98); color: rgb(253, 181, 21); font-weight: bold;"

Expected the element to have attribute:
  style="background: rgb(0, 50, 98); color: rgb(253, 181, 21); font-weight: bold;"
Received:
  style="background: rgb(0, 50

[Killed] StringLiteral
src/main/components/SectionsTableBase.js:66:31
                             ? "#FDB515" // UC Gold text for aggregated cells
                             : "#003262", // UC Blue text for regular cells
                           fontWeight: cell.isGrouped || cell.isAggregated
-                            ? "bold"
+                            ? ""
                             : "normal",
                         }}
killedBy: SectionsTableBase tests renders five sections (one with no discussion then lecture with three discussions) correctly
statusReason: Error: expect(element).toHaveAttribute("style", "background: rgb(0, 50, 98); color: rgb(253, 181, 21); font-weight: bold;") // element.getAttribute("style") === "background: rgb(0, 50, 98); color: rgb(253, 181, 21); font-weight: bold;"

Expected the element to have attribute:
  style="background: rgb(0, 50, 98); color: rgb(253, 181, 21); font-weight: bold;"
Received:
  style="background: rgb(0, 50

[Killed] EqualityOperator
src/main/components/SectionsTableBase.js:76:32
                               {...row.getToggleRowExpandedProps()}
                               data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-expand-symbols`}
                             >
-                              {row.subRows.length > 1
+                              {row.subRows.length >= 1
                                 ? row.isExpanded
                                   ? "➖ "
killedBy: SectionsTableBase tests renders a single lecture section correctly
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span data-testid="testid-cell-row-0-col-courseInfo.courseId-expand-symbols" style="cursor: pointer;" title="Toggle Row Expanded">➕ </span> instead

[Killed] StringLiteral
src/main/components/SectionsTableBase.js:82:42
                                   : "➕ "
                                 : null}
                             </span>{" "}
-                            {cell.render("Cell")}
+                            {cell.render("")}
                           </>
                         ) : cell.isAggregated ? (
killedBy: SectionsTableBase tests renders an full table without crashing
statusReason: Error: Renderer Error ☝️

[Killed] StringLiteral
src/main/components/SectionsTableBase.js:85:39
                             {cell.render("Cell")}
                           </>
                         ) : cell.isAggregated ? (
-                          cell.render("Aggregated")
+                          cell.render("")
                         ) : (
                           cell.render("Cell")
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: Renderer Error ☝️

[Killed] StringLiteral
src/main/components/SectionsTableBase.js:87:39
                         ) : cell.isAggregated ? (
                           cell.render("Aggregated")
                         ) : (
-                          cell.render("Cell")
+                          cell.render("")
                         )}
                         <></>
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: Renderer Error ☝️
