[Killed] BooleanLiteral
main/components/PersonalSchedules/AddToScheduleModal.js:12:46
 import { yyyyqToQyy } from "main/utils/quarterUtilities";
 
 export default function AddToScheduleModal({ section, quarter, onAdd }) {
-  const [showModal, setShowModal] = useState(false);
+  const [showModal, setShowModal] = useState(true);
   const [selectedSchedule, setSelectedSchedule] = useState("");
 
killedBy: AddToScheduleModal renders without crashing
statusReason: Error: useHref() may be used only in the context of a <Router> component.
