[Killed] ArrowFunction
main/pages/PersonalSchedules/PersonalSchedulesCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function PersonalSchedulesCreatePage() {
-  const objectToAxiosParams = (personalSchedule) => ({
-    url: "/api/personalschedules/post",
-    method: "POST",
-    params: {
-      name: personalSchedule.name,
-      description: personalSchedule.description
-        ? personalSchedule.description
-        : "",
-      quarter: personalSchedule.quarter,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (personalSchedule) => {
killedBy: PersonalSchedulesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesCreatePage.js:20:43
     },
   });
 
-  const onSuccess = (personalSchedule) => {
-    toast(
-      `New personalSchedule Created - id: ${personalSchedule.id} name: ${personalSchedule.name}`,
-    );
-  };
+  const onSuccess = (personalSchedule) => {};
 
   const onError = (error) => {
killedBy: PersonalSchedulesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New personalSchedule Created - id: 17 name: SampName"

Number of calls: 0

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesCreatePage.js:22:7
 
   const onSuccess = (personalSchedule) => {
     toast(
-      `New personalSchedule Created - id: ${personalSchedule.id} name: ${personalSchedule.name}`,
+      ``,
     );
   };
killedBy: PersonalSchedulesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New personalSchedule Created - id: 17 name: SampName"
Received: ""

Number of calls: 1
