[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:30:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/personalschedules?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/personalschedules`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="PersonalScheduleForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:55:31
     [],
   );
 
-  const objectToAxiosParams = (personalSchedule) => ({
-    url: "/api/personalschedules",
-    method: "PUT",
-    params: {
-      id: personalSchedule.id,
-    },
-    data: {
-      user: personalSchedule.user,
-      name: personalSchedule.name,
-      description: personalSchedule.description
-        ? personalSchedule.description
-        : "",
-      quarter: personalSchedule.quarter,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (personalSchedule) => {
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "PersonalSchedule Updated - id: 17 name: Winter Courses"
Received: "useBackendMutation: Error communicating with backend via get on undefined"

Number of calls: 1

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:55:54
     [],
   );
 
-  const objectToAxiosParams = (personalSchedule) => ({
-    url: "/api/personalschedules",
-    method: "PUT",
-    params: {
-      id: personalSchedule.id,
-    },
-    data: {
-      user: personalSchedule.user,
-      name: personalSchedule.name,
-      description: personalSchedule.description
-        ? personalSchedule.description
-        : "",
-      quarter: personalSchedule.quarter,
-    },
-  });
+  const objectToAxiosParams = (personalSchedule) => ({});
 
   const onSuccess = (personalSchedule) => {
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "PersonalSchedule Updated - id: 17 name: Winter Courses"
Received: "useBackendMutation: Error communicating with backend via get on undefined"

Number of calls: 1

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:61:11
     params: {
       id: personalSchedule.id,
     },
-    data: {
-      user: personalSchedule.user,
-      name: personalSchedule.name,
-      description: personalSchedule.description
-        ? personalSchedule.description
-        : "",
-      quarter: personalSchedule.quarter,
-    },
+    data: {},
   });
 
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "{}"
