[Killed] BlockStatement
main/components/PersonalSchedules/PersonalScheduleSelector.js:15:19
 }) => {
   const [scheduleState, setScheduleState] = useState(schedule);
 
-  useEffect(() => {
-    if (filteredSchedules.length > 0) {
-      setSchedule(filteredSchedules[0].id);
-    }
-  }, [filteredSchedules, setSchedule]);
+  useEffect(() => {}, [filteredSchedules, setSchedule]);
 
   const handleScheduleOnChange = (event) => {
killedBy: PersonalScheduleSelector sets the initial schedule when schedules are loaded
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "schedule1"

Number of calls: 0

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:16:9
   const [scheduleState, setScheduleState] = useState(schedule);
 
   useEffect(() => {
-    if (filteredSchedules.length > 0) {
+    if (false) {
       setSchedule(filteredSchedules[0].id);
     }
killedBy: PersonalScheduleSelector sets the initial schedule when schedules are loaded
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "schedule1"

Number of calls: 0

[Killed] EqualityOperator
main/components/PersonalSchedules/PersonalScheduleSelector.js:16:9
   const [scheduleState, setScheduleState] = useState(schedule);
 
   useEffect(() => {
-    if (filteredSchedules.length > 0) {
+    if (filteredSchedules.length >= 0) {
       setSchedule(filteredSchedules[0].id);
     }
killedBy: PersonalScheduleSelector sets the initial schedule when schedules are loaded
statusReason: TypeError: Cannot read properties of undefined (reading 'id')
