[Killed] BlockStatement
src/main/utils/PersonalScheduleUtils.js:18:53
   };
 }
 
-export function filterSchedules(quarter, schedules) {
-  return schedules.filter((schedule) => schedule.quarter === quarter);
-}
+export function filterSchedules(quarter, schedules) {}
 
killedBy: PersonalScheduleUtils filterSchedules Correctly filters schedules
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 1, "name": "Test 1", "quarter": "20241"}]
Received: undefined

[Killed] ConditionalExpression
src/main/utils/PersonalScheduleUtils.js:19:41
 }
 
 export function filterSchedules(quarter, schedules) {
-  return schedules.filter((schedule) => schedule.quarter === quarter);
+  return schedules.filter((schedule) => false);
 }
 
killedBy: PersonalScheduleUtils filterSchedules Correctly filters schedules
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   Object {
-     "id": 1,

[Killed] ConditionalExpression
src/main/utils/PersonalScheduleUtils.js:19:41
 }
 
 export function filterSchedules(quarter, schedules) {
-  return schedules.filter((schedule) => schedule.quarter === quarter);
+  return schedules.filter((schedule) => true);
 }
 
killedBy: PersonalScheduleUtils filterSchedules Correctly filters schedules
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 5

@@ -2,6 +2,11 @@
    Object {
      "id": 1,
